// Завдання 2. Якщо користувач вводить «Ім’я», то питати пароль, якщо натиснув скасувати(escape) - виводити «Вхід скасований», якщо вводить щось інше - «Я вас не знаю». Пароль перевіряти так. Якщо введений пароль «ЛОГОС», то виводити «Ласкаво просимо!», Інакше - «Пароль невірний», при скасуванні - «Вхід скасований».

let userName = prompt("Введіть своє ім’я", '');

if (userName === 'Діма') {

    let pass = prompt('Введіть свій пароль', '');

    if (pass === 'ЛОГОС') {
        alert('Ласкаво просимо!');
    } else if (pass === '' || pass === null) {
        alert('Вхід скасований');
    } else {
        alert('Пароль невірний');
    }

} else if (userName === '' || userName === null) {
    alert('Вхід скасований');
} else {
    alert("Я вас не знаю");
}