// Завдання 1. Написати тест на довільну тему з 10-ти питань. Якщо користувач відповідає вірно додаємо бал. Якщо відповідає не вірно тоді нічого не робимо. В кінці виводимо статистику про кількість правильних відповідей з можливих 10. І повідомлення для користувача про рівень знань відносно набраних балів.

let min = 0;
let max = 100;
let counter = 0;
let i = 0;

while (i < 10) {
    let random = Math.floor(Math.random() * (max - min + 1)) + min;
    let answer = confirm("Питання " + (i + 1) + "/10:\n Число " + random + " більше або дорівнює 50?");
   
    if ((random >= 50) && (answer == true)) {
        ++counter;
    }
    if ((random < 50) && (answer == false)) {
        ++counter;
    }
    i++;
}

alert("Вірних відповідей: " + counter + " з 10");